package Task8;

/*
Ти створюєш графічний редактор.

Продумай ієрархію класів. Мають бути як мінімум:

базовий клас для фігури Shape. Цей клас повинен мати метод для виведення назви фігури.
класи, що наслідуються від Shape - Circle, Quad тощо - не менше п'яти варіантів.
повинен бути клас, що приймає фігуру, та виводить її назву. Клас повинен працювати саме з базовим класом Shape.
Зверни увагу на використання засобів ООП - інтерфейсів, абстрактних класів, модифікаторів доступу.

Немає єдиного правильного шляху вирішення цієї задачі. Намагайсь спроектувати гнучку архітектуру,
задаючи собі запитання, наприклад, "А що буде, якщо цей клас потрібно буде змінювати? Що ще зміниться,
якщо тут потрібно буде розширити можливості?"

 */

abstract class Shape {

    abstract void printName();
}
